04_OpenFoam/_Tut_02/OpenFOAM-14/XiFluid/1D/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

laminarFlameSpeed
{
    model           unstrained;

    unstrainedLaminarFlameSpeed
    {
        model           constant;

        Su              0.3 [m/s];
    }
}

flameWrinkling
{
    model           equilibrium;
    // model           transport;

    eq
    {
        model      constant;
        XiEq       5;
    }

    profile
    {
        // model      uniform;
        model      linear;
        // model      cubic;
        // XiShapeCoeff  0.5;
    }

    generationRate
    {
        model           KTS;
    }

    #print
}

// ************************************************************************* //
